app/Actions/Fortify/CreateNewUser.php

insert into `users` (`name`, `email`, `password`, `account_type`, `updated_at`, `created_at`) values ('testadmin', 'testadmin@gmail.com', '$2y$12$HBs9RFxqog2Dg5D5btYDrOyut2cf1mysRmILuw0OPnFxpttNSx7jG', 'business_advertiser', '2025-04-03 12:58:03', '2025-04-03 12:58:03')
---
    public function create(array $input): User
    {
        Validator::make($input, [
            'name' => ['required', 'string', 'max:255'],
            'email' => [
                'required',
                'string',
                'email',
                'max:255',
                Rule::unique(User::class),
            ],
            'password' => $this->passwordRules(),
            'account_type' => ['required', 'string', Rule::in(['guest', 'premium', 'admin'])],
        ])->validate();

        return User::create([
            'name' => $input['name'],
            'email' => $input['email'],
            'password' => Hash::make($input['password']),
            'account_type' => $input['account_type'],
        ]);